In [1]:
import pandas as pd
import seaborn as sb
import numpy as np

###  Create

In [2]:
tnc = sb.load_dataset('titanic')
tnc = tnc.head(20)

In [ ]:
print(tnc.columns) # column names

In [ ]:
print(tnc.index) # index names

In [ ]:
print(len(tnc.columns)) # no of columns in dataset

In [ ]:
print(len(tnc.index)) # no of rows in dataset

In [ ]:
print(tnc.count()) # for each column gives not null rows

In [ ]:
print(tnc.head()) # top 5 rows default, return the number of rows if specified

In [ ]:
print(tnc.tail()) # last 5 rows default, return the number of rows if specified

In [ ]:
print(tnc.sample()) # random 5 rows default, return the random mber of rows if specified

In [ ]:
print(tnc.info()) # complete information about the dataset like number of rows, columns, dtypes

In [ ]:
print(tnc.corr()) # gives correlation for numeric columns
# correlation gives the rate of change of a given column with other column
# correlation is a bivariate analysis that measures the strength of association between two variables and 
# the direction of the relationship.

In [ ]:
print(tnc.dtypes) # returns the column with their datatypes

# below are statements to understand the memory space occupied by dtype 'object' compared to dtype 'category'
s = pd.Series(['man','woman']*1000)
print(s.dtype, s.nbytes)

s = pd.Series(['man','woman']*1000, dtype='category')
print(s.dtype, s.nbytes)

In [ ]:
tnc.describe(percentiles=[0.5]) #summary about each column, default for integer variables only
tnc.describe(include=['category','object'])
tnc.describe(percentiles=[0.5], exclude=['category','object','bool'], include=)
# 'int','float','category','object','bool'

In [ ]:
# gives distince values in the given column
print("unique values in the column deck:::\t\t", tnc.sex.unique()) 

# gives the number of unique values in the given column
print("number of unique values in the column deck:::\t", tnc.deck.nunique())

### Select/Slicing/Subset

##### based on dtypes

In [ ]:
tnc.head(3).select_dtypes(include='number')
tnc.head(3).select_dtypes(include='object')
tnc.head(3).select_dtypes(include='number')
# to select numeric column names
tnc.head(3).select_dtypes(include='number').names

In [3]:
?tnc.select_dtypes

##### based on in-built index

In [ ]:
# takes one less than the higher value of index
tnc.iloc[0:1,0:2]

##### based on user-defined names (renamed indexes)

In [ ]:
# slicing using both row_indexer and column_indexer
# if default index over-written, must use user-defined index
# includes both lower and higher values of indexer
tnc.loc[0:2, 'survived':'sibsp']

##### based on column names

In [ ]:
tnc_single_col = tnc['pclass']
tnc_mul_col = tnc[['survived', 'pclass']]

##### based on condition (filter)

In [7]:
tnc_pcl_3 = tnc[tnc.pclass==3]
tnc_pcl_3



tnc_fare = tnc[tnc.fare.between(10,100, inclusive=True)]
tnc_fare

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

### Add/Modify DataFrame
##### add new column
##### modify existing column
##### based on condition
##### modify column names
##### insert columns at specific position

##### add new column

In [ ]:
tnc['new_name'] = tnc['age']/tnc['fare']

##### modify existing column

In [ ]:
tnc['pclass'] = tnc['age']/tnc['fare']

##### add/modify based on condition

In [ ]:
tnc.loc[(tnc.age > 20) & (tnc.sex == 'male'), 'nw'] = 'tr'

##### modify column names

In [ ]:
# rename two of the columns by using the 'rename' method
tnc.rename(columns={'survived':'Survive', 'sex':'gender'}, inplace=True)
tnc.columns

##### insert column at a specific position

In [ ]:
# tnc.insert(integer location of new column to be inserted, new column name, value for new column, allow_duplicates=False)
tnc.insert(tnc.columns.get_loc("sibsp"), 'bar', tnc['deck'], allow_duplicates=False)

### Delete

### drop duplicates

In [106]:
tnc_hd = tnc.head()
tnc_hd

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
tnc_hd.drop_duplicates(subset=['survived'], keep=False, inplace=False)

### Mark duplicates: 
### duplicated will return a Series with True or False based on a given subset

In [ ]:
tnc_hd['survived_dup'] = tnc_hd.duplicated(subset=['survived'], keep='first')
tnc_hd
# Keep = 'first' makes the first occurence of duplicate value for a given subset as False and 
#         the remaining occurence of duplicate row as True
# Keep = 'last' makes the last occurence of duplicate value for a given subset as False and 
#         the remaining occurence of duplicate row as True
# Keep = False makes the all the occurence of duplicate value for a given subset as True

#### drop rows

In [ ]:
tnc.drop([0,1], axis=0, inplace=True) # drop rows
# after droping rows the in-built index will not be from 0 to n, 
#     so you cannot use broadcasting operator (:) in iloc to subset the dataset

In [ ]:
tnc_hd = tnc.head(3)
tnc_hd

#### drop rows based on condition

In [ ]:
tnc_hd.drop(tnc_hd[tnc_hd.survived == 0].index, axis=0, inplace=True)
tnc_hd

#### drop columns

In [ ]:
tnc.drop(['survived','pclass'], axis=1, inplace=True)

##### drop null rows/columns

In [ ]:
tnc.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
# how
# * 'any' : If any null values are present, drop that row or column.
# * 'all' : only if all values are null, drop that row or column.
# thresh : int, optional, Require that many not null values.

In [3]:
tnc_hd10 = tnc.head(10)
tnc_hd10

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [ ]:
tnc_hd10.dropna(axis=1, thresh=5, subset=None, inplace=False)

### replace null

##### replace null with a number

In [ ]:
tnc['age'].fillna('200', inplace=True)

##### replace null with median/mean/mode

In [ ]:
tnc_age_null = tnc[tnc.age.isnull()] #filter null rows

In [ ]:
tnc_age_null['age'].fillna(tnc['age'].median(), inplace=True)
tnc_age_null

###### convert mode to list

In [ ]:
df = pd.DataFrame([5,5,5,5,6,6,6,6,7,7])
list(df.mode()[0])

###### replace null value with mean for all the numeric column

In [48]:
tnc=pd.DataFrame([[5,6,np.nan,7],[10,np.nan,np.nan,np.nan],[np.nan,np.nan,np.nan,4]])
tnc1 = pd.DataFrame(tnc, copy=True)

In [ ]:
print(tnc1)
tnc1[tnc1.select_dtypes(include='number').columns].fillna(tnc1[tnc1.select_dtypes(include='number').columns].mean())

###### function to replace null value with mean for all the numeric column

In [ ]:
def rplc_null(num_col,fnc, qtl_val):
    for val in num_col:
        print(val)
        if fnc == 'mn':
            tnc[val].fillna(tnc[val].mean(), inplace=True)
        elif fnc == 'mdn':
            tnc[val].fillna(tnc[val].median(), inplace=True)
        elif fnc == 'qtl':
            tnc[val].fillna(tnc[val].quantile(q=qtl_val), inplace=True)

In [ ]:
rplc_null(tnc.select_dtypes(include='number').columns, 'qtl', 0.7)

### frequency of classes in a categorical column

In [ ]:
# it wil display how many time each value is repeated in the column
# write a function to automate for all categorical column
tnc.embark_town.value_counts().reset_index()

In [ ]:
tnc.embark_town.value_counts(normalize=True).reset_index()

### Sort the dataframes by columns

In [ ]:
print(tnc.sort_values(by=['sex','class'], ascending=[False, False], inplace=False))
# after sorting the in-built row index will be re-arranged, 
#     so you cannot use broadcasting operator (:) in iloc to subset the dataset
#     use reset_index(drop=True) to regenerate the row index from 0 to n
print(tnc.sort_values(by=['sex','class'], ascending=[False, False], inplace=False).reset_index(drop=True))

### Group by

In [83]:
data = {'Company':['GOOG','FB','MSFT','MSFT','GOOG','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Trans':[4,3,7,2,6,10]}
df = pd.DataFrame(data)
df

  Company   Person  Sales  Trans
0    GOOG      Sam    200      4
1      FB  Charlie    120      3
2    MSFT      Amy    340      7
3    MSFT  Vanessa    124      2
4    GOOG     Carl    243      6
5      FB    Sarah    350     10

In [78]:
?g.rank

##### creating group object

In [74]:
g = df.groupby('Company')

In [ ]:
print(g.sum())
print(g.min())
print(g.max())
print(g.median())
print(g.std())
print(g.var())
print(g.size())
print(g.describe().loc['FB'])

##### extract the nth largest in each group
need to sort the dataframe before extracting

In [ ]:
df.sort_values(by=['Company','Sales'], ascending=[True, False], inplace=True)
df

In [ ]:
g.nth(2)

##### ranking the columns by groups
Please go through merge before trying to understand this

In [ ]:
df.merge(df.groupby('Company')[['Sales','Trans']].rank(method='first'), 
         left_index=True, right_index=True, suffixes=('', '_rank'))
# df.groupby('Company')

In [ ]:
print(g.describe())
# selecting in multilevel index
#     1st level index in tuple and 2nd level index in list enclosed in round braces. same applies for multilevel row index
df = g.describe().loc[:,(('Sales','trans'),['count','25%'])]
del df.index.name # delete the name of the index
df

### Merge/Join

In [2]:
emp_exp = pd.DataFrame([['e1',7],['e2',5],['e3',3]], columns=['Empid','exp'])
emp_age = pd.DataFrame([['e2',25],['e3',35],['e4',40]], columns=['Empid','age'])
print(emp_exp, "\n", emp_age)

  Empid  exp
0    e1    7
1    e2    5
2    e3    3
   Empid  age
0    e2   25
1    e3   35
2    e4   40

In [6]:
emp_exp.merge(emp_age, left_on='exp', right_index=True, how='outer')
# emp_exp

  Empid_x  exp Empid_y   age
0      e1    7     NaN   NaN
1      e2    5     NaN   NaN
2      e3    3     NaN   NaN
2     NaN    0      e2  25.0
2     NaN    1      e3  35.0
2     NaN    2      e4  40.0

In [ ]:
tnc_hd.merge(tnc_tl[['adult_male','survived']], on='survived', how='outer', suffixes=('_x', '_y'))

In [ ]:
tnc_hd.merge(tnc_tl[['adult_male','survived', 'sibsp']], left_on='survived', right_on='sibsp', how='outer', 
             left_index=False, right_index=False, suffixes=('_x', '_y'))

### change datatypes of columns

In [ ]:
tnc = tnc.astype(dtype= {"class":"object", "deck":"object"})

### rename columns

In [ ]:
# rename two of the columns by using the 'rename' method
tnc.rename(columns={'survived':'Survive', 'sex':'gender'}, inplace=True)
tnc.columns

In [ ]:
# replace characters in column names
tnc.columns = tnc.columns.str.replace("-","_")

### Crosstab

In [ ]:
pd.crosstab(str_db['Store no'], str_db[['Sales', 'Units', 'Trasaction']], 
            values=str_db[['Sales', 'Units', 'Trasaction']], aggfunc=np.sum)

In [41]:
?pd.crosstab

In [ ]:
pd.crosstab(index, columns, values=None, rownames=None, colnames=None, aggfunc=None, margins=False, margins_name='All', dropna=True, normalize=False)

## store dashboard

In [42]:
str_db = pd.read_excel("G:\Analytics6\Machine Learning\Dashboard (1) (1).xlsx", sheet_name='Sheet2')

In [ ]:
str_db.dtypes

In [ ]:
def age_desc(cl):
    if cl.age >= 0  and cl.age <= 18:
        return '0 - 18'
    elif cl.age >= 18  and cl.age < 24:
        return '18 - 24'
    elif cl.age >= 24  and cl.age < 35:
        return '24 - 35'
    elif cl.age >= 35  and cl.age <= 50:
        return '35 - 50'
    elif cl.age >=50:
        return '50+'
    else:
        return np.nan

str_db['age_desc'] = str_db.apply(age_desc, axis=1)

#### Store Sales - Executive Dashboard: Table1 left

In [ ]:
ex_db_tb1 = str_db[['Store no', 'Sales', 'Units', 'Trasaction']].groupby(['Store no']).sum()

In [ ]:
ex_db_tb1['Basket Value']= ex_db_tb1.Sales/ex_db_tb1.Trasaction
ex_db_tb1['Basket Size'] = ex_db_tb1.Units/ex_db_tb1.Trasaction
ex_db_tb1

In [ ]:
str_gp = str_db.groupby(['Store no'])

#### Store Sales - Executive Dashboard: Table1 right

In [ ]:
ex_db_tb2 = str_gp['Sales'].describe().reset_index()

In [ ]:
md_lst = []
for name, group in str_gp: #default it fetches each datframe, not group values
    md_lst.append(group['Sales'].mode())

In [ ]:
ex_db_tb2['md'] = md_lst
ex_db_tb2['IQR'] = ex_db_tb2['75%'] - ex_db_tb2['25%']
ex_db_tb2['range'] = ex_db_tb2['max'] - ex_db_tb2['min']

ex_db_tb2

#### Store Sales - Executive Dashboard: last table left

In [ ]:
gndr_age_gp = str_db[['Gender', 'age_desc', 'Sales', 'Units', 'Trasaction']].groupby(['Gender','age_desc']).sum()
gndr_age_gp['Basket Value']= gndr_age_gp.Sales/gndr_age_gp.Trasaction
gndr_age_gp['Basket Size'] = gndr_age_gp.Units/gndr_age_gp.Trasaction
gndr_age_gp

In [ ]:
gndr_age_gp = gndr_age_gp.stack().unstack(level=1)

###  Datetime

In [ ]:
?pd.to_datetime

In [ ]:
?pd.Timedelta
Timedelta(days, seconds, microseconds, milliseconds, minutes, hours, weeks)
# pd.Timedelta(days=10)

In [ ]:
pd.to_datetime(arg, errors='raise', dayfirst=False, yearfirst=False, utc=None, box=True, format=None, exact=True, unit=None, infer_datetime_format=False, origin='unix', cache=False)

In [ ]:
pd.Timestamp.min
Timestamp('1677-09-21 00:12:43.145225')

pd.Timestamp.max
Timestamp('2262-04-11 23:47:16.854775807')

In [ ]:
tnc_hd2['nw'] = pd.to_datetime([0,1,2,3], unit='D')
# origin=pd.Timestamp('1960-01-01'))

In [ ]:
tnc_hd2.dtypes

In [ ]:
tnc_hd2.nw.dt.hour

In [ ]:
tnc_hd2

In [ ]:
tnc_hd2 = tnc.head(4)
tnc_hd2['nw'] = ['3/11/2000', '3/13/2000', '31/12/2261', '12/13/1677']

In [ ]:
tnc_hd2 = tnc_hd2.astype(dtype= {"nw":"datetime64[ns]"})
# tnc_hd2 = tnc_hd2.astype(dtype= {"nw":"dt"})

In [ ]:
tnc_hd2['nw']+pd.Timedelta(days=10)

In [ ]:
tnc.pclass == 3

In [ ]:
?tnc.rename

In [ ]:
tnc_head = tnc.head(10)
tnc_head.sort_values(by=['sex','class'], ascending=[False, False], inplace=True)
tnc_head

In [ ]:
tnc_head.sort_index(axis=0, inplace=True)

In [ ]:
tnc_head.index=list(range(len(tnc_head.index)))

In [ ]:
tnc_head.drop(tnc_head[tnc_head.survived == 0].index, axis=0, inplace=True)

In [ ]:
# reset_index()
tnc_head.reset_index()

In [ ]:
?tnc.drop_duplicates

In [ ]:
tnc_head = tnc.tail(20)
tnc_head.loc[871, 'fare'] = np.nan

In [ ]:
tnc_head

In [ ]:
tnc_head['age',]

In [ ]:
df.to_csv('foo.txt)

In [ ]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
        ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']] 

tuples = list(zip(*arrays))

In [ ]:
?pd.reset_index()

# Take away - How to:
## create dataframe
## slicing
## filtering
## add/modify
## delete columns/duplicates
## replace duplicates
## groupby
## Merge/Join

### Automation

##### replace outliers

In [ ]:
tip_num = sb.load_dataset('titanic')
for key, value in tip_num[['survived','fare', 'age']].iteritems():
#     tip_num[key].fillna(40, inplace=True)
#     print(key, value)
    utv = tip_num[key].describe()['75%'] + ((tip_num[key].describe()['75%'] - tip_num[key].describe()['25%'])*1.5)
    ltv = tip_num[key].describe()['25%'] - ((tip_num[key].describe()['75%'] - tip_num[key].describe()['25%'])*1.5)
    rplc = tip_num.loc[(tip_num[key] >= ltv) & (tip_num[key] <= utv), key].mean()
#     print(key, utv, ltv, rplc)
    tip_num.loc[(tip_num[key] < ltv) | (tip_num[key] > utv), key] = rplc

##### replace special characters

In [ ]:
data = {'Company':['GOO#G','F%^B','M SFT','M  SFT','GOOG','FB'],
       'Person':['Sam','Char!lie','Am!!y','Vane!!ssa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'Trans':[4,3,7,2,6,10]}
df = pd.DataFrame(data)

for key, val in df.select_dtypes(exclude='number').iteritems():
    print(key, len(val))
    spl_str = set()
    for sn in val:
        for j in range(len(sn)):
            if not(sn[j].isalpha()):
                spl_str.add(sn[j])
#     spl_str = list(spl_str)
    for val in spl_str:
        df[key]=df[key].str.replace(val,'')